var l10n = {
    name: 'ug_vk',
    description: {
        short: 'JavaScript تا يېزىلغان ئۇيغۇرچە مەۋھۇم كۇنۇپكا تاختىسى',
        long: 'بۇ JavaScript تا يېزىلغان ئۇيغۇرچە مەۋھۇم كۇنۇپكا تاختىسى بولۇپ، نۆۋەتتە كۆپ قىسىم ئۇيغۇرچە تور بېكەتلەردە ئومۇميۈزلۈك ئىشلىتىلىۋاتقان، مۇھەممەد ئابدۇللاھ ئەپەندى يازغان «يۇلغۇن تور يۈزىدە ئۇيغۇرچە كىرگۈزۈش دېتالى» (<a href="http://www.yulghun.com/news/vkb.html">bedit.js</a>) ئاساسىدا ئەلالاشتۇرۇلۇپ ۋە زامانىۋىيلاشتۇرۇلۇپ ئىشلەنگەن.'
    },
    gitHub: {
        viewProject: 'تۈر تور بېتى',
        download: 'چۈشۈر',
        file: 'ھۆججەت',
        maintainedBy: 'تۈر ئاسرىغۇچىسى'
    },
    whatsNew: {
        title: 'يېڭىلىقلار',
        features: [
            'ھەجىمى كىچىك. كىچىكلىتىلگەن ۋە gzip لانغان نۇسخىسىنىڭ ھەجىمى ئارانلا 2202 بايت!',
            'سوزۇق تاۋۇشلارنىڭ ئۇيغۇرچە سۆزلەردىكى ئورۇنى (سۆز بېشى ياكى قىسمەن ئەھۋاللاردا سۆز ئارىسى) غا ئاساسەن، ئاپتوماتىك ھالدا «ئ» (ھەمزە) قوشۇپ بېرەلەيدۇ. بۇ ئىقتىدار نۆۋەتتە پەقەت W3C ئۆلچەملىرىگە بويسۇنغان تور كۆرگۈچلەر، مەسىلەن،  Mozilla Firefox, Google Chrome, Apple Safari, Microsoft Internet Explorer قاتارلىقلار ۋە ئۇلارنىڭ كۆچمە نۇسخىلىرىنىڭ ئەڭ يېڭى نەشىرىدىلا ئىشلەيدۇ؛',
            'iOS ۋە Android دىكى تور كۆرگۈچلەردە، تېكست كىرگۈزۈش رامكىسىنىڭ ئىچىدە بىر بارمىقىڭىز بىلەن توغرىسىغا سىيپاش (horizontal swipe) ئارقىلىش كۇنۇپكا تاختا ھالىتىنى ئۇيغۇرچە ۋە لاتىنچە ئارىسىدا ئالماشتۇرغىلى بولىدۇ؛ ئۈستەل يۈزى تور كۆرگۈچلىرىدە بولسا، ئەسلىدىكى [Ctrl-K] كۇنۇپكا بىرىكمىسى ئارقىلىق ئالماشتۇرغىلى بولىدۇ؛',
            '[Ctrl-T] ياكى [Ctrl-Y] كۇنۇپكا بىرىكمىسى (Mac تە [Command-T] ياكى [Command-Y]) ئارقىلىق كىرگۈزۈش يۆنىلىشىنى ئوڭدىن-سولغا ياكى سولدىن-ئوڭغا قىلىپ تەڭشىگىلى بولىدۇ؛',
            'ھەرقايسى تېكست كىرگۈزۈش رامكىلىرىنىڭ كۇنۇپكا تاختا ھالىتى بىر-بىرىدىن مۇستەقىل ھالدا ئۆزگىرىدىغان قىلىندى؛',
            'مەزكۇر كۇنۇپكا تاختىسى ئالاقىدار ئۆلچەملەرگە ئاساسەن ئۆلچەملەشتۈرۈلدى؛',
            'Internet Explorer 8 ۋە ئۇنىڭدىن تۆۋەن نەشىردىكى Internet Explorer لارغا قارىتا، توغرا ۋە ئىشەنچىلىك ئۇسۇللار ئارقىلىق، DOM تەييار بولغاندا پروگراممىنى يۈكلەش ئەمەلگە ئاشۇرۇلدى؛',
            'UEY ۋە ULY ئارىسىدا ئۆزئارا ئالماشتۇرۇش كودى چىقىرىۋېتىلدى؛',
            'كونا «ئەلكاتىپ» كودىدىن Unicode غا ئالماشتۇرۇش كودى چىقىرىۋېتىلدى؛'
        ]
    },
    tryIt: {
        title: 'سىناپ بېقىڭ',
        features: [
            '«ئ» (ھەمزە) كۇنۇپكىسى ([/]) نى ئىشلەتمەي تۇرۇپ، بۇ سۆزلەرنى كىرگۈزۈپ بېقىڭ: «ئۇيغۇر»، «ئائىلە»، «ئاتا-ئانا»، «نۇقتىئىينەزەر»، «1-ئىيۇن»؛',
            'ئەگەر بۇ تور بەتنى iOS ياكى Android دىكى تور كۆرگۈچلەردە كۆرۈۋاتقان بولسىڭىز، ئۈستىدىكى تېكست كىرگۈزۈش رامكىسىنىڭ ئىچىدە بىر بارمىقىڭىز بىلەن (تەخمىنەن 50px ئارىلىقتا) توغرىسىغا سىيپاش ئارقىلىق كۇنۇپكا تاختا ھالىتىنى ئۇيغۇرچە بىلەن لاتىنچە ئارىسىدا ئالماشتۇرۇپ، خەت كىرگۈزۈپ بېقىڭ (دىققەت، كىرگۈزۈش ھالىتىنى ئالماشتۇرۇلغاندا ھازىرىچە ھېچقانداق ئەسكەرتمە ئۇچۇر چىقمايدۇ، سىيپاش ھەرىكىتىنى ئاخىرىلاشتۇرغاندىن كېيىن، خەت كىرگۈزۈش ئارقىلىق نۆۋەتتىكى كىرگۈزۈش ھالىتىنى پەرقلەندۈرگىلى بولىدۇ)؛ ئەگەر بۇ تور بەتنى ئۈستەل يۈزى تور كۆرگۈچلەردە كۆرۈۋاتقان بولسىڭىز:',
            '[Ctrl-K] ئارقىلىق كۇنۇپكا تاختا ھالىتىنى ئۇيغۇرچە بىلەن لاتىنچە ئارىسىدا ئالماشتۇرۇپ بېقىڭ؛',
            '[Ctrl-Y] ئارقىلىق كىرگۈزۈش يۆنىلىشىنى ئوڭدىن-سولغا ياكى سولدىن-ئوڭغا ھالەتلىرى ئارىسىدا ئالماشتۇرۇپ بېقىڭ؛'
        ]
    },
    howToUse: {
        title: 'ئىشلىتىش ئۇسۇلى',
        instructions: {
            header: 'يېڭى ئۇسۇل (تەۋسىيە قىلىنىدۇ)',
            or: 'ياكى',
            step1: 'بىرىنچى باسقۇچ',
            step2: 'ئىككىنچى باسقۇچ',
            varDeclarations: 'تور بېتىڭىزنىڭ HTML كودى ئىچىدىكى <code>&lt;head&gt;</code> بەلگىسىنىڭ ئىچىگە بىر دانە <code>&lt;script&gt;</code> بەلگىسى قويۇپ، مەزكۇر كۇنۇپكا تاختىسىنىڭ تەڭشەك ئۆزگەرگۈچلىرىگە ئېنىقلىما بېرىسىز:',
            legacy: {
                header: 'كونا ئۇسۇل (تەۋسىيە قىلىنمايدۇ)',
                beditJSVarsReuse: '(نۆۋەتتە تور بېكىتىڭىزدە bedit.js نى ئىشلىتىۋاتقان بولسىڭىز، ئۆزىڭىز تەڭشەپ قويغان ئۆزگەرگۈچلەرنى مۇشۇ <code>&lt;script&gt;</code> .بۆلىكىنىڭ ئىچىگە ئۆز پېتى كۆچۈرۈپ قويسىڭىزمۇ نورمال ئىشلەۋېرىدۇ.)',
                separateUsingColon: '// <code>name</code> xasliq qimmetlirini qosh chekit (:) bilen ayring.'
            },
            varExplanations: 'يۇقىرىقى كوددىكى ھەر قايسى ئۆزگەرگۈچلەرنىڭ رولى: ',
            whitelist: 'بۇ ئۆزگەرگۈچتە، ئۇيغۇرچە كىرگۈزۈش ئىقتىدارى قوشۇلماقچى بولغان <code>&lt;input&gt;</code> ۋە <code>&lt;textarea&gt;</code> ئېلېمېنتلىرى (مەسىلەن، مۇنبەرلەردىكى ئاختۇرۇش (ئىزدەش) رامكىلىرى، تېما ياكى ئىنكاس يېزىش رامكىلىرى قاتارلىقلار) نى ئۇلارنىڭ <code>name</code> خاسلىقى ئارقىلىق بەلگىلەپ بېرىسىز.',
            all: 'قىممىتى <code>true</code> بولغاندا، نۆۋەتتىكى بەتتىكى بارلىق <code>&lt;input&gt;</code> ۋە <code>&lt;textarea&gt;</code> ئېلېمېنتلىرىدا ئۇيغۇرچە كىرگۈزۈشكە بولىدۇ.',
            blacklist: 'بۇ ئۆزگەرگۈچتە، ئۇيغۇرچە كىرگۈزۈش ئىقتىدارى چەكلەنمەكچى بولغان <code>&lt;input&gt;</code> ۋە <code>&lt;textarea&gt;</code> ئېلېمېنتلىرى (مەسىلەن، مۇنبەرلەردىكى تور بېكەت ئادرېسى، ئېلخەت، پارول، ۋە ياكى ئەزا ھېسابات نومۇرى كىرگۈزۈش رامكىلىرى) نى ئۇلارنىڭ <code>name</code> خاسلىقى ئارقىلىق بەلگىلەپ بېرىسىز.',
            ugvkInclusion:  'يۇقىرىدىكى <code>&lt;script&gt;</code> بەلگىسىدىن كېيىن، يەنە بىر دانە <code>&lt;script&gt;</code> بەلگىسىنى يېزىش ئارقىلىق ug_vk.js ياكى ئۇنىڭ ھەجىمى كىچكرەك نۇسخىسى، ug_vk.min.js، نى قوشىسىز:',
            thatsIt: 'ۋەسسالام، ئىش تامام!'
        }
    }
};

